# Day 4: Sorting Data with ORDER BY ðŸŽˆ

Today we learn how to sort results using the `ORDER BY` clause.

### 1. Database Connection

In [1]:
import mysql.connector
import pandas as pd

conn = mysql.connector.connect(
    host="localhost",
    user="root",
    password="",
    database="sql_30days_challenge"
)
cursor = conn.cursor()
print("Connected to 'sql_30days_challenge'!")

Connected to 'sql_30days_challenge'!

---

## Practice Exercises ðŸ–‹

### 1. Retrieve all employees and sort them by `name` in ascending order

In [2]:
query = "SELECT * FROM employees ORDER BY name ASC"
pd.read_sql(query, conn)

C:\Users\lenovo\AppData\Local\Temp\ipykernel_19332\2792984647.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql(query, conn)

   id        name  age department  salary
0   2  Jane Smith   25         IT   60000
1   1    John Doe   30         HR   50000
2   4   Lisa Wong   28         IT   70000
3   5    Mark Lee   32  Marketing   45000
4   3   Sam Brown   35  Marketing   55000

### 2. Sort the `employees` table by `department` in descending order

In [3]:
query = "SELECT * FROM employees ORDER BY department DESC"
pd.read_sql(query, conn)

C:\Users\lenovo\AppData\Local\Temp\ipykernel_19332\3253548570.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql(query, conn)

   id        name  age department  salary
0   3   Sam Brown   35  Marketing   55000
1   5    Mark Lee   32  Marketing   45000
2   2  Jane Smith   25         IT   60000
3   4   Lisa Wong   28         IT   70000
4   1    John Doe   30         HR   50000

### 3. Combine sorting by `age` in ascending order and `department` in alphabetical order

In [4]:
query = "SELECT * FROM employees ORDER BY age ASC, department ASC"
pd.read_sql(query, conn)

C:\Users\lenovo\AppData\Local\Temp\ipykernel_19332\3477565336.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql(query, conn)

   id        name  age department  salary
0   2  Jane Smith   25         IT   60000
1   4   Lisa Wong   28         IT   70000
2   1    John Doe   30         HR   50000
3   5    Mark Lee   32  Marketing   45000
4   3   Sam Brown   35  Marketing   55000

### 4. Sort `products` by `price` in descending and `stock_quantity` in ascending order
(First, let's insert data into products)

In [5]:
products_data = [
    (1, 'Laptop', 1200.00, 10),
    (2, 'Mouse', 25.50, 50),
    (3, 'Keyboard', 75.00, 20),
    (4, 'Monitor', 200.00, 15),
    (5, 'USB Cable', 10.00, 100)
]
cursor.executemany("INSERT IGNORE INTO products VALUES (%s, %s, %s, %s)", products_data)
conn.commit()

query = "SELECT * FROM products ORDER BY price DESC, stock_quantity ASC"
pd.read_sql(query, conn)

C:\Users\lenovo\AppData\Local\Temp\ipykernel_19332\2246499824.py:12: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql(query, conn)

   product_id product_name   price  stock_quantity
0           1       Laptop  1200.0              10
1           4      Monitor   200.0              15
2           3     Keyboard    75.0              20
3           2        Mouse    25.5              50
4           5    USB Cable    10.0             100

In [6]:
conn.close()